export const allQuestion = [
    {
      question: "Open House มีอะไรให้ทำบ้าง ?",
      answer:
        "มีกิจกรรมแนะนำทุกภาควิชาในมจธ. รวมถึงเปิดโอกาสให้น้อง ๆ เข้าร่วมกิจกรรม workshop ของแต่ละภาคเพื่อสัมผัสบรรยากาศจริงของการเรียนวิศวฯ ตลอดระยะเวลา 3 วัน นอกจากได้รับความรู้และประสบการณ์แล้ว น้อง ๆ ยังสามารถร่วมกิจกรรม E-stamp เพื่อแลกของที่ระลึกสุดพิเศษได้อีกด้วย",
    },
    {
      question: "กิจกรรม Workshop มีการลงทะเบียนหน้างานแบบ Walk-in หรือไม่ ?",
      answer: "สามารถลงทะเบียนล่วงหน้าผ่านเว็บไซต์เเละลงทะเบียนหน้างานเเบบ Walk-in ได้ทั้ง 2 เเบบ",
    },
    {
      question: "เดินทางมายังไง",
      answer:
        "การเดินทางมามจธ. มีรถโดยสารประจำทางให้บริการตามจุดต่าง ๆ โดยน้อง ๆ สามารถดูรายละเอียดด้านล่าง",
    },
    {
      question: "เตรียมตัวยังไง เอาอะไรไปบ้าง",
      answer:
        "โทรศัพท์มือถือที่ติดตัวได้ เพราะกิจกรรมของเราจะมีการเก็บ E-Stamp ผ่านเว็บไซต์ เพื่อแลกของที่ระลึก",
    },
    {
      question: "แต่งกายอย่างไรดี ?",
      answer:
        "ชุดนักเรียนหรือชุดสุภาพ (กางเกงขายาว รองเท้าหุ้มส้น) ไม่แนะนำเสื้อแขนกุด เสื้อสายเดี่ยว เสื้อเอวลอย กางเกงขาสั้น หรือรองเท้าแตะ",
    },
    {
      question: "ผู้ปกครอง หรือ คุณครูเข้าร่วมกิจกรรมได้หรือไม่ ?",
      answer:
        "ผู้ปกครอง คุณครู หรือบุคคลภายนอกที่สนใจสามารถลงทะเบียนเพื่อเข้าร่วมกิจกรรมต่าง ๆ ได้",
    },
    {
      question: "มีประกาศณียบัตรให้ไหม ?",
      answer:
        "มีประกาศณียบัตรให้เเต่ต้องเป็นไปตามเงื่อนไขของกิจกรรม โดยสะสม E-stamp ให้ครบตามจำนวนที่กำหนดเพื่อรับประกาศณียบัตร",
    },
  ];
