import { Checkbox } from "./input/CheckboxInput";
import { Button } from "./input/Button";
import { Link } from "react-router-dom";
import { useState } from "preact/hooks";

export const Consent = ({ setConsent }) => {
  const [accept, setAccept] = useState(false);
  const handleCheck = (e) => {
    setAccept(e.target.checked);
    e.preventDefault();
  }
  return (
    <>
      <div className="w-screen min-h-screen md:h-fit p-10 md:p-20 flex justify-center items-center">
        <div className="bg-white w-full h-fit md:h-fit p-8 md:p-10 flex flex-col rounded-xl shadow-lg shadow-black/50 text-gray-500 z-50">
          <h1 className="text-juicy-200 text-4xl lg:text-6xl font-bold tracking-wide mb-2 md:mb-5 uppercase">นโยบายข้อมูลส่วนบุคคล</h1>
          <div className="flex flex-col space-y-5 h-full">
            <div className="bg-juicy-100/20 w-full h-1/2 max-h-[40vh] rounded-xl p-4 text-lg scrollbar-thin scrollbar-thumb-juicy-100 scrollbar-track-juicy-100/25 overflow-y-scroll scrollbar-thumb-rounded-full scrollbar-track-rounded-full">
              <p className="h-1/2 md:h-1/3">
                <p className="font-semibold">นโยบายข้อมูลส่วนบุคคล</p> <br />

                1. ข้อมูลสำคัญเกี่ยวกับโครงการ <br />
                <ul class="ml-4">
                  <li>
                    1. โครงการแข่งขันแก้ไขปัญหาด้วยการเขียนโปรแกรมคอมพิวเตอร์ ระดับมัธยมศึกษาตอนปลาย ปีการศึกษา 2565 หรือ BangMod Hackathon 2023 ซึ่งต่อจากนี้จะเรียกว่า "โครงการ" ดำเนินการโดยคณะทำงานโครงการ ซึ่งต่อจากนี้จะเรียกว่า “คณะทำงาน”
                  </li>
                  <li>
                    2. คณะทำงานเป็นผู้ให้บริการเว็บไซต์ bangmodhackathon.com และเว็บไซต์ที่เกี่ยวข้อง ซึ่งต่อจากนี้จะเรียกรวมว่า "เว็บไซต์"
                  </li>
                  3. ผู้ใช้งานเว็บไซต์ ซึ่งต่อจากนี้จะเรียกว่า “ท่าน” หรือ “คุณ” เป็นบุคคลหรือผู้แทนที่มีสิทธิในการยินยอมให้ข้อมูลส่วนบุคคลของบุุคคลทั้งหมด
                  <li>
                    4. เนื่องด้วยโครงการได้เห็นความสำคัญของการรักษาข้อมูลส่วนบุคคลของผู้ใช้ จึงได้กำหนดนโยบายความเป็นส่วนตัวนี้ขึ้น เพื่อกำหนดความมุ่งมั่นของโครงการต่อความเป็นส่วนตัวของผู้ใช้งาน รวมถึงชี้แจงให้ทราบเกี่ยวกับกระบวนวิธีการ การเก็บรวบรวม การใช้ และการเปิดเผยข้อมูลส่วนบุคคลในโครงการ ดังนั้นกรุณาอ่านนโยบายความเป็นส่วนตัวนี้โดยละเอียด โดยเมื่อเข้าใช้งานเว็บไซต์ของโครงการ และยอมรับนโยบายที่เกี่ยวข้องนี้ อย่างชัดเจน จะถือว่าท่านรับทราบและยอมรับข้อกำหนดนโยบายข้อมูลส่วนบุคคลนี้แล้ว หากท่านไม่ยอมรับนโยบายข้อมูลส่วนบุคคล ท่านจะไม่สามารถทำการสมัครผ่านเว็บไซต์ของโครงการได้
                  </li>
                </ul>

                <br />

                2. ข้อมูลส่วนบุคคล หรือ ข้อความส่วนบุคคลที่โครงการเก็บรวบรวมเกี่ยวกับผู้ใช้ ซึ่งเป็นข้อมูลที่ทำให้สามารถระบุตัวตนของท่านได้ อาจทำการเก็บรวบรวม ใช้ และถ่ายโอนข้อมูลส่วนบุคคลประเภทต่าง ๆ ที่เกี่ยวกับผู้ใช้ตามที่โครงการได้จัดกลุ่มไว้ด้วยกัน ดังต่อไปนี้
                <ul class="ml-4">
                  <li>
                    1. ข้อมูลส่วนตัว ได้แก่ ชื่อ นามสกุล ชื่อเล่น วันเดือนปีเกิด เบอร์โทรศัพท์ รูปถ่าย  สำเนาบัตรประชาชนของท่าน ไลน์ และอีเมลเพื่อใช้สำหรับการติดต่อ รวมไปถึงอาหาร/ยาที่แพ้และโรคประจำตัว
                  </li>
                  <li>
                    2. ข้อมูลการศึกษา ได้แก่ ใบรับรองผลการศึกษา (ปพ.7) ระดับการศึกษา หลักสูตร ชื่อสถานศึกษาและจังหวัด
                  </li>
                </ul>

                <br />

                3. โครงการอาจเก็บรวบรวมข้อมูลเกี่ยวกับผู้ใช้หลายวิธี ได้แก่ การเก็บข้อมูลปฏิสัมพันธ์โดยตรง การกรอกแบบฟอร์มบนเว็บไซต์รับสมัครของโครงการ เพื่อทำการสมัครเข้าร่วมโครงการ เป็นต้น
                <ul class="ml-4">
                  <li>
                    1. เทคโนโลยีอัตโนมัติหรือปฏิสัมพันธ์
                    ในขณะที่ท่านโต้ตอบกับเว็บไซต์ของโครงการ ระบบเทคโนโลยีอัตโนมัติโครงการใช้งานบนเว็บไซต์อาจรวบรวมข้อมูลทางเทคนิค เช่น ข้อมูลเกี่ยวกับเบราว์เซอร์ของท่านโดยอัตโนมัติ ว่าท่านเข้าเยี่ยมชมพื้นที่ใดบนเว็บไซต์ของโครงการและลิงก์ที่ท่านคลิกดูเหตุการณ์ ช่วยให้โครงการสามารถส่งมอบประสบการณ์ที่ดีแก่ท่านเมื่อท่านเข้าชมเว็บไซต์ของโครงการ และยังช่วยให้โครงการสามารถปรับปรุงพัฒนาเว็บไซต์ให้ดียิ่งขึ้น
                  </li>
                  <li>
                    2. บุคคลที่สาม หรือ แหล่งข้อมูลสาธารณะ โครงการจะเก็บข้อมูลของผู้ใช้ผ่านการเข้าสู่ระบบโดยใช้สื่อสังคมออนไลน์ ทำให้โครงการอาจเก็บรวบรวมข้อมูลการติดต่อ อัตลักษณ์ และข้อมูลทางเทคนิค รวมไปถึง ชื่อผู้ใช้งาน รูปประจำตัวผู้ใช้งาน และ อีเมล ข้อมูลเกี่ยวกับสื่อสังคมออนไลน์ที่ท่านยินยอมเปิดเผยกับโครงการจะไปรวมกับข้อมูลที่ผู้ใช้ให้กับโครงการไว้ หรือที่โครงการรวบรวมไว้เกี่ยวกับท่าน
                  </li>
                </ul>

                <br />

                4. วัตถุประสงค์ของการใช้ข้อมูลส่วนบุคคล
                โครงการมีวัตถุประสงค์ในการใช้ข้อมูล ดังต่อไปนี้
                <ul class="ml-4">
                  <li>1. โครงการใช้ข้อมูลส่วนบุคคลเพื่อยืนยันคุณสมบัติและคัดเลือกผู้เข้าร่วมโครงการ</li>
                  <li>2. โครงการใช้ข้อมูลส่วนบุคคลเพื่อจัดกิจกรรมในโครงการ</li>
                  <li>3. โครงการใช้ข้อมูลส่วนบุคคลเพื่อจัดทำใบประกาศนียบัตรสำหรับผู้ที่เข้าร่วมโครงการ</li>
                  <li>4. โครงการใช้ข้อมูลส่วนบุคคลเพื่อให้สามารถติดต่อผู้ดูแลได้ในกรณีฉุกเฉิน</li>
                  <li>5. โครงการใช้ข้อมูลแบบไม่ระบุตัวตน และข้อมูลเทคโนโลยีอัตโนมัติเพื่อใช้ในการวิเคราะห์ข้อมูลทางสถิติ</li>
                </ul>

                <br />

                5. ระยะเวลาในการเก็บข้อมูลส่วนบุคคล
                <p className="ml-4">
                  โครงการจะเก็บข้อมูลส่วนบุคคลของท่านเท่าที่จำเป็น ในการจัดโครงการครั้งปัจจุบัน และสำหรับโครงการครั้งถัดไป โดยไม่เกิน 4 ปี
                </p>

                <br />

                6. สิทธิของท่านเกี่ยวกับข้อมูลส่วนบุคคล
                <p className="ml-4">
                  ท่านสามารถใช้สิทธิที่ท่านมีอยู่ตามกฎหมายคุ้มครองข้อมูลส่วนบุคคล อันรวมถึงการเข้าถึง การแก้ไข การลบ และระงับการประมวลผลข้อมูลส่วนบุคคล โดยติดต่อผ่านทางผู้ดูแลข้อมูลของโครงการ ได้ที่อีเมล {`{natasha.dej@kmutt.ac.th}`}
                </p>
              </p>

            </div>
            <div className="space-y-2">
              <Checkbox
                label="ยินยอมข้อตกลงนโยบายข้อมูลส่วนบุคคล"
                name="accept"
                onChange={handleCheck}
              />
            </div>
            <div className="w-full md:w-2/3 flex flex-row self-center space-x-2 md:space-x-20">
              <Button type="1" text="ยอมรับ" onClick={(e) => {
                setConsent(accept);
                console.log(accept)
                e.preventDefault();
              }} />
              <Link to="/login" className="w-full">
                <Button type="2" text="ยกเลิก" />
              </Link>
            </div>
            <span className="w-full flex justify-center text-lg text-decorate-100 space-x-1 mt-2">
              <p>Already a user? </p>
              <a href="/login" className="hover:text-juicy-100/75 underline">LOGIN</a>
            </span>
          </div>
        </div>
      </div>
    </>
  );
}
