export const DataPolicy = () => {
  return (
    <div className="bg-juicy-100/20 rounded-lg max-h-[50vh] text-md md:text-xl scrollbar-thin scrollbar-thumb-juicy-100 scrollbar-track-juicy-100/25 overflow-y-scroll scrollbar-thumb-rounded-full scrollbar-track-rounded-full">
      <ol className="m-4 md:m-6 md:mr-8 space-y-2" style="scrollbar-color: #8C2B0C">
        <li>
          ข้อมูลสำคัญเกี่ยวกับโครงการ
          <ol>
            <li> โครงการ Road to Engineering at Bangmod : เส้นทางสู่วิศวฯ บางมด ซึ่งต่อจากนี้จะเรียกว่า "โครงการ" ดำเนินการโดย คณะวิศวกรรมศาสตร์ มจธ. และสโมสรนักศึกษาคณะวิศวกรรมศาสตร์ มจธ. ซึ่งต่อจากนี้จะเรียกว่า “คณะทำงาน” </li>
            <li> คณะทำงานเป็นผู้ให้บริการเว็บไซต์ bangmod.engineering และเว็บไซต์ที่เกี่ยวข้อง ซึ่งต่อจากนี้จะเรียกรวมว่า "เว็บไซต์" </li>
            <li> ผู้ใช้งานเว็บไซต์ ซึ่งต่อจากนี้จะเรียกว่า “ท่าน” หรือ “คุณ” เป็นบุคคลหรือผู้แทนที่มีสิทธิในการยินยอมให้ข้อมูลส่วนบุคคลของบุคคลทั้งหมด</li>
            <li> เนื่องด้วยโครงการได้เห็นความสำคัญของการรักษาข้อมูลส่วนบุคคลของผู้ใช้ จึงได้กำหนดนโยบายความเป็นส่วนตัวนี้ขึ้น เพื่อกำหนดความมุ่งมั่นของโครงการต่อความเป็นส่วนตัวของผู้ใช้งาน รวมถึงชี้แจงให้ทราบเกี่ยวกับกระบวนวิธีการ การเก็บรวบรวม การใช้ และการเปิดเผยข้อมูลส่วนบุคคลในโครงการ ดังนั้นกรุณาอ่านนโยบายความเป็นส่วนตัวนี้โดยละเอียด โดยเมื่อเข้าใช้งานเว็บไซต์ของโครงการ และยอมรับนโยบายที่เกี่ยวข้องนี้ อย่างชัดเจน จะถือว่าท่านรับทราบและยอมรับข้อกำหนดนโยบายข้อมูลส่วนบุคคลนี้แล้ว หากท่านไม่ยอมรับนโยบายข้อมูลส่วนบุคคล ท่านจะไม่สามารถทำการสมัครผ่านเว็บไซต์ของโครงการได้</li>
          </ol>
        </li>
        <li>ข้อมูลส่วนบุคคล หรือ ข้อความส่วนบุคคลที่โครงการเก็บรวบรวมเกี่ยวกับผู้ใช้ ซึ่งเป็นข้อมูลที่ทำให้สามารถระบุตัวตนของท่านได้ อาจทำการเก็บรวบรวม ใช้ และถ่ายโอนข้อมูลส่วนบุคคลประเภทต่าง ๆ ที่เกี่ยวกับผู้ใช้ตามที่โครงการได้จัดกลุ่มไว้ด้วยกัน ดังต่อไปนี้
          <ol>
          <li> ข้อมูลส่วนตัว ได้แก่ ชื่อ นามสกุล ชื่อเล่น รูปถ่าย และอีเมลเพื่อใช้สำหรับการติดต่อ </li>
          <li> บัญชีโซเชียลมีเดีย เช่น ไลน์ไอดี (LINE ID) บัญชีผู้ใช้ Facebook ไอดี Facebook (Facebook ID) ไอดี Google (Google ID)</li>
          <li> ข้อมูลการศึกษา ได้แก่ ระดับการศึกษา หลักสูตร ชื่อสถานศึกษาและจังหวัด</li>
          <li> ข้อมูลทางเทคนิค ได้แก่ IP Address, MAC Address, บันทึกข้อมูลการเข้าใช้งานหรือการติดตามพฤติกรรมการใช้งานเว็บไซต์ จาก Session ID, ชนิดและรุ่นของเว็บบราวเซอร์</li>
          </ol>
        </li>
        <li>โครงการอาจเก็บรวบรวมข้อมูลเกี่ยวกับผู้ใช้หลายวิธี ได้แก่ การเก็บข้อมูลปฏิสัมพันธ์โดยตรง การกรอกแบบฟอร์มบนเว็บไซต์รับสมัครของโครงการ เพื่อทำการสมัครเข้าร่วมโครงการ เป็นต้น
          <ol>
          <li> เทคโนโลยีอัตโนมัติหรือปฏิสัมพันธ์
          ในขณะที่ท่านโต้ตอบกับเว็บไซต์ของโครงการ ระบบเทคโนโลยีอัตโนมัติโครงการใช้งานบนเว็บไซต์อาจรวบรวมข้อมูลทางเทคนิค เช่น ข้อมูลเกี่ยวกับเบราว์เซอร์ของท่านโดยอัตโนมัติ ว่าท่านเข้าเยี่ยมชมพื้นที่ใดบนเว็บไซต์ของโครงการและลิงก์ที่ท่านคลิกดูเหตุการณ์ ช่วยให้โครงการสามารถส่งมอบประสบการณ์ที่ดีแก่ท่านเมื่อท่านเข้าชมเว็บไซต์ของโครงการ และยังช่วยให้โครงการสามารถปรับปรุงพัฒนาเว็บไซต์ให้ดียิ่งขึ้น</li>
          <li> บุคคลที่สาม หรือ แหล่งข้อมูลสาธารณะ
          โครงการจะเก็บข้อมูลของผู้ใช้ผ่านการเข้าสู่ระบบโดยใช้สื่อสังคมออนไลน์ ทำให้โครงการอาจเก็บรวบรวมข้อมูลการติดต่อ อัตลักษณ์ และข้อมูลทางเทคนิค รวมไปถึง ชื่อผู้ใช้งาน รูปประจำตัวผู้ใช้งาน และ อีเมล ข้อมูลเกี่ยวกับสื่อสังคมออนไลน์ที่ท่านยินยอมเปิดเผยกับโครงการจะไปรวมกับข้อมูลที่ผู้ใช้ให้กับโครงการไว้ หรือที่โครงการรวบรวมไว้เกี่ยวกับท่าน </li>
          </ol>
        </li>

        <li>วัตถุประสงค์ของการใช้ข้อมูลส่วนบุคคล<br/>
          <p className="ml-5">โครงการมีวัตถุประสงค์ในการใช้ข้อมูล ดังต่อไปนี้</p>
          <ol>
            <li> โครงการใช้ข้อมูลส่วนบุคคลเพื่อจัดกิจกรรมในโครงการ</li>
            <li> โครงการใช้ข้อมูลส่วนบุคคลเพื่อจัดทำใบประกาศนียบัตรสำหรับผู้ที่เข้าร่วมโครงการ</li>
            <li> โครงการใช้ข้อมูลส่วนบุคคลเพื่อให้สามารถติดต่อผู้ดูแลได้ในกรณีฉุกเฉิน</li>
            <li> โครงการใช้ข้อมูลแบบไม่ระบุตัวตน และข้อมูลเทคโนโลยีอัตโนมัติเพื่อใช้ในการวิเคราะห์ข้อมูลทางสถิติ</li>

            <li> ระยะเวลาในการเก็บข้อมูลส่วนบุคคล
            โครงการจะเก็บข้อมูลส่วนบุคคลของท่านเท่าที่จำเป็น ในการจัดโครงการครั้งปัจจุบัน และสำหรับโครงการครั้งถัดไป โดยไม่เกิน 4 ปี</li>

            <li> สิทธิของท่านเกี่ยวกับข้อมูลส่วนบุคคล
            ท่านสามารถใช้สิทธิที่ท่านมีอยู่ตามกฎหมายคุ้มครองข้อมูลส่วนบุคคล อันรวมถึงการเข้าถึง การแก้ไข การลบ และระงับการประมวลผลข้อมูลส่วนบุคคล โดยติดต่อผ่านทางผู้ดูแลข้อมูลของโครงการ ได้ที่อีเมล   <a href="mailto:stdunion.eng@kmutt.ac.th" className="text-juicy-200" >stdunion.eng@kmutt.ac.th</a> </li>
          </ol>
        </li>
      </ol>
    </div>
  )
}
