export const MiniBus = () => {
  return (
    <>
      รถโดยสารประจำทางที่สามารถมาถึงมหาวิทยาลัยรถโดยสารประจำทางหลายสาย
      สามารถเดินทางมาถึงมหาวิทยาลัยได้ โดยต้องมาลงถนนสุขสวัสดิ์ – ถนนราษฎร์บูรณะ
      และขึ้นรถโดยสารประจำทางที่ผ่านมหาวิทยาลัย หรือรถโดยสารขนาดเล็ก
      <div className="indent-2">
        <li>
          สายรถ 142 เส้นทางเดินรถ การเคหะ ชุมชนธนบุรี – อู่ฟาร์มจระเข้
          (สมุทรปราการ)
        </li>
        <li>
          สายรถ 141 เส้นทางเดินรถ แสมดำ – จุฬาลงกรณ์มหาวิทยาลัย สายรถ 140
        </li>
        <li>
          เส้นทางเดินรถ อนุสาวรีย์ชัยฯ – แสมดำ สายรถ 138 เส้นทางเดินรถ พระประแดง
          –
        </li>
        <li>หมอชิตใหม่ สายรถ 82 เส้นทางเดินรถ พระประแดง – สนามหลวง สายรถ 20</li>
        <li>
          เส้นทางเดินรถ สุขสวัสดิ์ – ท่าดินแดง สายรถ 6 เส้นทางเดินรถ พระประแดง –
          เทเวศร์
        </li>
      </div>
    </>
  );
};
